Repository: PhilippMatthes/homepage
Catalog: homepage/locale/*/LC_MESSAGES/django.po
Languages: de

# website_title
source: Philipp Matthes - Software Development, Ubiquitous Applications, Machine Learning and Cloud Computing.
de: Philipp Matthes - Softwareentwicklung, Ubiquitous Applications, Machine Learning und Cloud Computing.

# website_description
source: Your partner in digital innovation, ubiquitous and adaptive computing, goal-driven project realization, artificial intelligence and more.
de: Ihr Ansprechpartner für digitale Innovation, ubiquitäre und adaptive Software-Anwendungen, zielorientierte IT-Projektrealisierung, künstliche Intelligenz, Cloud Computing und mehr.

# website_subject
source: Homepage of Philipp Matthes.
de: Homepage von Philipp Matthes.

# personal_description
source: I am Philipp Matthes - computer scientist and <a href="https://ropsten.etherscan.io/token/0x0ff809878aff65dc553b7be1b68e9851c49c3fb5?a=0xe66bA65d2e7c61df343D3Df7A28F94fcd8c06240">self made PhilippCoin billionaire</a>. I am currently working on my diploma thesis in the field of machine learning on smartphones. I am also a tutor for software technology. Here are other projects I've worked on:
de: Ich bin Philipp Matthes - Informatiker und <a href="https://ropsten.etherscan.io/token/0x0ff809878aff65dc553b7be1b68e9851c49c3fb5?a=0xe66bA65d2e7c61df343D3Df7A28F94fcd8c06240">Self Made PhilippCoin-Milliardär</a>. Ich arbeite gerade an meiner Diplomarbeit im Bereich Machine-Learning auf Smartphones. Außerdem bin ich Tutor für Softwaretechnologie. Hier sind weitere Projekte, an denen ich gearbeitet habe:

source: Services
de: Dienstleistungen

source: Research
de: Forschung

source: CV
de: Lebenslauf

source: English
de: Englisch

source: German
de: Deutsch

# email
source: Mail
de: E-Mail

source: Featured Project
de: Vorgestelltes Projekt

# ubiquitous_applications_description
source: Do you need someone with the know-how to realize your app idea? Let’s go. I am familiar with everything you need. User-oriented UI/UX-Design and motivation engineering, technical realization of the software, team coordination - I combine multiple disciplines to engineer the product you need. Contact me to get started.
de: Ich liebe es, Apps zu erstellen. Ich habe bereits mehrere Apps entwickelt und distribuiert, auf Android und hauptsächlich iOS. Außerdem habe ich mich im Studium auf App-Entwicklung spezialisiert. Für mich zählt es nicht nur, dass eine App für ihre Anwendungsfälle gut entworfen ist, sondern auch eine bestmögliche Nutzererfahrung bietet. Ich erreiche dies durch eine strukturierte und domänenorientierte Denkweise, um viele mögliche Lösungen für einen Anwendungsfall einzubeziehen. So bin ich unter anderem mit Strategien wie der Integration von Kontextadaptivität und Mobile/Offline-First-Ansätzen vertraut. Außerdem halte ich mich stets auf dem Laufenden, was aktuelle Technologien und Systemupdates betrifft, und kenne die aktuellsten Frameworks wie SwiftUI, Metal, CoreML, Vision und viele weitere.

# peerbridge_description
source: <strong><a rel="noreferrer" href="https://github.com/peerbridge" target="_blank">The Peerbridge Blockchain Messenger</a></strong> employs new SwiftUI features such as the new <a rel="noreferrer" href="https://developer.apple.com/documentation/swiftui/lazyvstack" target="_blank">LazyVStack</a> or the new <a rel="noreferrer" href="https://developer.apple.com/documentation/cryptokit" target="_blank">CryptoKit</a> framework. The messenger is an experimental proof-of-concept to demonstrate how a distributed blockchain can be used to create a shared, fully-anonymous and confidential message distribution system.
de: <strong><a rel="noreferrer" href="https://github.com/peerbridge" target="_blank">Der Peerbridge Blockchain Messenger</a></strong> nutzt die neuesten SwiftUI-Features wie den <a rel="noreferrer" href="https://developer.apple.com/documentation/swiftui/lazyvstack" target="_blank">LazyVStack</a> oder das neue <a rel="noreferrer" href="https://developer.apple.com/documentation/cryptokit" target="_blank">CryptoKit</a> Framework. Der Messenger ist ein experimentelles Proof-of-Concept, um zu demonstrieren, wie eine verteilte Blockchain dazu genutzt werden kann, um ein öffentliches und dennoch vollständig anonymes Nachrichtenverteilsystem zu realisieren.

# cloud_computing_title
source: Engineering ubiquitous systems, like mobile or IOT applications, requires solutions to make development, distribution and data flow more efficient, scalable and robust.
de: Die Entwicklung von ubiquitären Systemen wie Smartphone- oder IOT-Apps erfordert neuartige Lösungen, um Programmierung, Distribution und Datenfluss effizienter, skalierbarer und robuster zu machen.

source: Blockchain and Consensus
de: Blockchain und Konsensus

# blockchain_and_consensus_description
source: Blockchain solves problems where it is of interest to share and synchronize a writable database across many untrustworthy hosts, not only in the field of cryptocurrency. For Example, we use a Blockchain for our experimental proof-of-concept Messenger Peerbridge to store and distribute messages.
de: Blockchain löst Probleme, bei denen die Realisation einer schreibbaren und verteilten Datenbank sowie deren Synchronisation zwischen mehreren nicht vertrauenswürdigen Netzwerkteilnehmern notwendig ist. Zum Beispiel nutzt unser experimenteller Messenger Peerbridge eine verteilte Blockchain, um Nachrichten zu speichern und zu verteilen.

source: Continuous Everything and DevOps
de: Continuous Everything und DevOps

# continuous_everything_and_devops_description
source: Cloud systems can be used to significantly reduce time to market while opening new possibilities for software validation and verification workflows. Jobs that would take time and effort to perform can be efficiently performed in the cloud. In Continuous Integration, the software is committed to a cloud system and automatically validated with tests and code analysis tools. Software that passes cross-feedback and quality gates can be continuously published, deployed and distributed. For example, <a rel="noreferrer" href="https://fastlane.tools/" target="_blank">Fastlane</a> can be used on iOS to directly build, sign and distribute application archives to <a rel="noreferrer" href="https://appstoreconnect.apple.com/" target="_blank">Apple App Store Connect</a> and <a rel="noreferrer" href="https://testflight.apple.com/" target="_blank">TestFlight</a>. My blog <a rel="noreferrer" href="https://xn--53hy230o.ws/" target="_blank">☕💻.ws</a> uses a continuous publishing workflow to synchronize its blog entries with a content repository. This makes change management very straightforward, without any needs to manually deploy and update the blog.
de: Cloud-Systeme können genutzt werden, um die Zeit zur Markteinführung eines Produktes signifikant zu reduzieren und gleichzeitig Validierungs- und Verifikationsaufwand auszulagern. Bestimmte Aufgaben, die sonst Zeit und Kraft in Anspruch nehmen, können so effizient in der Cloud ausgeführt werden. Bei der so genannten Continuous Integration wird Software in ein Cloudsystem geschickt und automatisch mithilfe von Tests und Codeanalysetools überprüft. Software, die das Cross-Feedback und die Qualitätsziele erfüllt, kann anschließend automatisiert publiziert, installiert und distribuiert werden. Bei iOS-Software zum Beispiel kann <a rel="noreferrer" href="https://fastlane.tools/" target="_blank">Fastlane</a> genutzt werden, um Apps automatisch zu signieren und zu archivieren, so dass das fertige Archiv ohne manuellen Aufwand direkt an <a rel="noreferrer" href="https://appstoreconnect.apple.com/" target="_blank">Apple App Store Connect</a> und <a rel="noreferrer" href="https://testflight.apple.com/" target="_blank">TestFlight</a> übermittelt wird. Mein Blog <a rel="noreferrer" href="https://xn--53hy230o.ws/" target="_blank">☕💻.ws</a> nutzt beispielsweise auch einen Continous Publishing Workflow, um die Blogeinträge mit einem GitHub-Repository zu synchronisieren. So wird das Änderungsmanagement vereinfacht und systematisch automatisiert.

source: Service Oriented Architecture
de: Serviceorientierte Architektur

# service_oriented_architecture_description
source: While monolithic systems are perfect to fit smaller applications with only a few contributors, systems with very high server loads and many development teams usually directly depend on their scalability, load-wise and development-wise. If applicable, it can be a good solution to split a monolithic system into smaller individual systems that each cover a unique set of capabilities. This requires new software development paradigms and patterns. Teams may then be able to significantly profit from their independent development cycles and the clear interfaces they have to offer in terms of interoperability. The application itself scales better under, for example, an elastic load balancer which distributes load to the individual services. As an even more radical approach, Microservices can be tailored to encapsulate only a tiny set of functionalitites. Our experimental app <a rel="noreferrer" href="https://ordered.online">ordered.online</a> uses such a principle together with Docker Swarm based containerization.
de: Während monolithische Systeme normalerweise sehr gut für kleinere Applikationen geeignet sind, erfordern Cloud-Systeme mit sehr hohen Serverlasten und größeren Entwicklerteams andere Ansätze, um die Skalierbarkeit der Entwicklung und der Anwendung selbst zu gewährleisten. Gegebenenfalls kann es eine gute Lösung sein, monolithische Applikationen systematisch in kleinere Teile mit eigenen Verantwortlichkeiten zu separieren. Dies erfordert neue Softwareentwicklungsmuster und Paradigmen. So können Teams signifikant von deren Unabhängigkeit zwischeneinander und der Notwendigkeit von klaren interoperablen Schnittstellen profitieren. Die Applikation selbst kann in ihrer separierten Form besser unter einer Lastverteilung skalieren. Als ein radikalerer Ansatz kann eine Applikation auch in so genannten Microservices organisiert werden, welche jeweils nur eine sehr reduzierte Gruppe an Verantwortlichkeiten tragen, um noch besser zu skalieren, durch die individuelle Replikation der notwendigen Funktionalitäten. Zum Beispiel nutzt unsere experimentelle App <a rel="noreferrer" href="https://ordered.online">ordered.online</a> Microservices, die hierbei durch Docker containerisiert und mit Docker Swarm repliziert werden.

source: Distributed Systems
de: Verteilte Systeme

# distributed_systems_description
source: For many use cases it may be necessary to decentralize an application in the form of a distributed system. Distributed systems require a sufficient informedness about their basic principles, since many regular software patterns found in the classical client-server concept can no longer be used. Our <a rel="noreferrer" href="https://github.com/peerbridge">Peerbridge Messenger</a> is a distributed system and uses the concept of distributed hash tables to connect clients.
de: Für viele Anwendungsfälle ist es möglicherweise notwendig, eine Applikation zu dezentralisieren, in Form eines verteilten Systems. Verteilte Systeme erfordern eine ausreichende Informiertheit über deren Grundprinzipien, da viele normale Softwarepatterns aus dem klassischen Client-Server-Modell nicht mehr angewendet werden können. Unser <a rel="noreferrer" href="https://github.com/peerbridge">Peerbridge Messenger</a> ist konzipiert als ein verteiltes System und nutzt das Prinzip von verteilten Hashtabellen (DHTs), um Nutzer miteinander zu verbinden.

# cloud_computing_subtitle
source: In a continuously evolving technological environment, not only portability and durability is increasingly important, but also (social) connectedness. The shown principles of Cloud Computing are important to maximize the product value while minimizing development and support expenses.
de: In einer kontinuierlich fortschreitenden technischen Umgebung sind nicht nur Portierbarkeit und Nachhaltigkeit zunehmend wichtig, sondern auch eine (soziale) Verbundenheit. Die gezeigten Prinzipien aus dem Cloud Computing sind wichtig, um den Produktwert zu steigern, während Entwicklungs- und Supportaufwände reduziert werden.

# machine_learning_title
source: Do you want to classify user behavior, suggest products or predict trends? These are just some examples of what’s possible with expertise in the field of artificial intelligence. Do you need ai directly on your smartphone? I am your man.
de: Als die Hot Topics der Informatik lösen Künstliche Intelligenz und vor allem Machine Learning Probleme, die zuvor nicht zufriedenstellend gelöst werden konnten. Von der Datenanalyse über deren Strukturierung und Segmentierung, Klassifikation von Sensordaten bishin zur generativen Erzeugung von menschenähnlichen Stimmen - Künstliche Intelligenz ist ein mächtiges Werkzeug, um den Kontext und die Umgebung des Nutzers zu interpretieren.

# machine_learning_project_description
source: <strong><a rel="noreferrer" href="https://github.com/3dify-app" target="_blank">The 3Dify app</a></strong> uses multi-camera-array disparity computation on photos to generate depth maps and use them for a 3d parallax effect. The app is context-aware such that on devices without multi-camera-arrays, it creates the depth maps by monocular depth interpretation using a neural pipeline and the new CoreML/Vision frameworks. In this way, even users without a device capable of disparity calculation can use the parallax effect.
de: <strong><a rel="noreferrer" href="https://github.com/3dify-app" target="_blank">Die 3Dify App</a></strong> nutzt durch Multi-Kamera-Arrays gestützte Disparitätsbestimmung in Fotos für die Erzeugung eines 3D Parallax-Effektes. Durch den technischen Kontext ist dies auf manchen Endgeräten nicht möglich - hier erzeugt die kontextadaptive App die benötigten Disparitätsinformationen durch monokulare Tiefeninterpretation über das neuronale Netzwerk <a rel="noreferrer" href="https://developer.apple.com/machine-learning/models/" target="_blank">FCRN-DepthPrediction</a>.

# machine_learning_project_adaption_title
source: Adaptivity through CoreML and Vision
de: Adaptivität durch CoreML und Vision

# machine_learning_project_adaption_description
source: <strong>On-Device Machine Learning</strong> brings new possibilities. For example, the 3Dify app uses an Artificial Intelligence to interpret depth information into photos. This is a very good example for how current AI research can be used in mobile applications to solve a specific use case.
de: Der Einsatz von <strong>On-Device Machine Learning</strong> eröffnet neue Horizonte. In der 3Dify App wird beispielsweise eine Künstliche Intelligenz verwendet, welche Tiefeninformationen in Fotos herein interpretiert. Ein sehr gutes Beispiel dafür, wie KI-Spitzenforschung in mobilen Anwendungen eingesetzt werden kann, um einen konkreten Anwendungsfall zu lösen.

# fullstack_title
source: I never limit myself to a specific technology and always analyze, which technology is the best for a use case and leverage its advantages. This way I am very flexible to new challenges. Plus, its fun to learn new technologies and languages!
de: Ich beschränke mich niemals auf nur eine Technologie. Mithilfe einer gezielten Analyse entscheide ich im Voraus, welche Technologie sich für einen Anwendungsfall besonders eignet. Auf diese Weise bin ich immer sehr flexibel und bereit für neue Herausforderungen. Außerdem macht es Spaß, neue Technologien und Sprachen zu lernen!

# fullstack_description
source: Do you have something in mind? I am always interested in new business opportunities or job inquiries. Contact me: <a rel="noreferrer" href="mailto:contact@philippmatth.es">contact@philippmatth.es</a>
de: Haben Sie eine Projektidee? Ich bin jederzeit interessiert an neuen geschäftlichen und beruflichen Opportunitäten. Kontaktieren Sie mich: <a rel="noreferrer" href="mailto:contact@philippmatth.es">contact@philippmatth.es</a>

source: Blockchain Addresses
de: Blockchain-Adressen

source: GitHub Profile
de: GitHub-Profil

# blog_on_ccws
source: Blog on ☕💻.ws
de: Blog auf ☕💻.ws

source: Twitter Profile
de: Twitter-Profil

# made_with_love
source: Made with ❤️ by Philipp Matthes.
de: Gemacht mit ❤️ von Philipp Matthes.

# contribute
source: Contribute to this Website
de: An der Website mitwirken
